python/python2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-08-22 Mon 19:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Fernanda Sanchez" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Enunciados y Expresiones</a></li>
<li><a href="#orgheadline2">2. Operadores y Operandos</a></li>
<li><a href="#orgheadline3">3. Precedencia de Operadores</a></li>
<li><a href="#orgheadline4">4. Raíz Cuadrada</a></li>
<li><a href="#orgheadline5">5. Ejemplo: sinh(x)</a></li>
<li><a href="#orgheadline6">6. Ejercicios</a></li>
</ul>
</div>
</div>
<p>
#-*- mode: org -*-
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Enunciados y Expresiones</h2>
<div class="outline-text-2" id="text-1">
<p>
Un <b>Enunciado</b> es una instrucción que se puede ejecutar.
</p>

<ul class="org-ul">
<li>Asignación.
<ul class="org-ul">
<li>x = 2</li>
</ul></li>
<li>Impresión.
<ul class="org-ul">
<li>print(x)</li>
</ul></li>
</ul>

<p>
Una <b>Expresión</b> es una combinación de valores, variables y operadores.
El interprete evalua una expresión y despliega su resultado.
</p>

<div class="org-src-container">

<pre class="src src-python">1 + 1 
# 2
</pre>
</div>

<p>
Las computadoras son quisqillosas con la sintaxis!
</p>

<div class="org-src-container">

<pre class="src src-python">myvar = 5.2
prinnt Myvar
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Operadores y Operandos</h2>
<div class="outline-text-2" id="text-2">
<p>
Los <b>Operadores</b> son símbolos especiales que representan operaciones.
Los <b>Operandos</b> son los valores que usan los operadores.
</p>

<p>
20+32   
</p>

<p>
hour-1   
</p>

<p>
hour*60+minute   
</p>

<p>
minute/60   
</p>

<p>
5**2   
</p>

<p>
(5+9)*(15-7)
</p>

<div class="org-src-container">

<pre class="src src-python">minute = 59
print minute/60
</pre>
</div>

<p>
Dos tipos de división:
</p>
<ul class="org-ul">
<li>Entera (/)</li>

<li>Flotante (//)</li>
</ul>

<div class="org-src-container">

<pre class="src src-python">print minute//60
print float(minute)/60
print (minute*1.0)/60
print minute/60.0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Precedencia de Operadores</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>PEMDAS</b> es una forma útil de recordar el orden de los operadores:
</p>

<ul class="org-ul">
<li>*P*arentesis tiene la mayor precedencia</li>
<li>*E*xponenciación</li>
<li>*M*ultiplicación y *D*ivisión</li>
<li>*A*sociatividad y *S*ustracción</li>
<li>Operadores con la misma precedencia son evaluados de izquierda a derecha</li>
</ul>

<p>
5/9+2*a**4/2
</p>

<p>
5/(9+2)*a**(4/2)
</p>
</div>
</div>


<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Raíz Cuadrada</h2>
<div class="outline-text-2" id="text-4">
<p>
Retomando la fórmula para la altura de una pelota en movimiento vertical:
</p>

<p>
\[ y_c = v_0t − \frac{1}{2}gt^2 \]
</p>

<p>
Pregunta: En qué tiempo la pelota alcanza la altura y<sub>c</sub> ?
</p>

<p>
Debemos resolver la ecuación cuadrática respecto a y.
</p>

<p>
\[ \frac{1}{2} gt^2 − v_0t + y_c = 0 \]
</p>

<p>
Usando "chicharronero" :
</p>

<p>
\[ t_1 = (v0 − \sqrt(v_0^2 - 2 g y_c ) ) / g \]
\[ t_2 = (v0 + \sqrt(v_0^2 - 2 g y_c ) ) / g \]
</p>


<p>
Necesitamos usar la función raíz cuadrada, importando el módulo <b>math</b> de python.
</p>

<p>
Formas de importar un módulo:
</p>
<ul class="org-ul">
<li>import math
<ul class="org-ul">
<li>x = math.sqrt(y)</li>
</ul></li>
<li>from math import sqrt
<ul class="org-ul">
<li>x = sqrt(y)</li>
</ul></li>
<li>import math as m
<ul class="org-ul">
<li>x = m.sqrt(y)</li>
</ul></li>
</ul>

<div class="org-src-container">

<pre class="src src-python">import math

v0 = 5
g = 9.81
yc = 0.2

t1 = (v0 - math.sqrt(v0**2 - 2*g*yc))/g
t2 = (v0 + math.sqrt(v0**2 - 2*g*yc))/g
print ’At t=%g s and %g s, the height is %g m.’ % (t1, t2, yc)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> Ejemplo: sinh(x)</h2>
<div class="outline-text-2" id="text-5">
<p>
\[ sinh(x) = \frac{1}{2} (e^x - e^{-x} ) \]
</p>

<p>
Podemos evaluar sinh(x) de 3 formas:
</p>
<ul class="org-ul">
<li>Usando math.sinh</li>
<li>Evaluar el lado derecho usando math.exp</li>
<li>Evaluar el lado derecho usando math.e**x</li>
</ul>

<div class="org-src-container">

<pre class="src src-python">from math import sinh, exp, e, pi
x = 2*pi
r1 = sinh(x)
r2 = 0.5*(exp(x) - exp(-x))
r3 = 0.5*(e**x - e**(-x))
print r1, r2, r3
</pre>
</div>


<p>
El resultado con 16 decimales:
</p>
<div class="org-src-container">

<pre class="src src-python">print ’%.16f %.16f %.16f’ % (r1,r2,r3)
# 267.7448940410164369 267.7448940410164369 267.7448940410163232
</pre>
</div>

<p>
El programa opera con números reales y los números reales necesitan
un número infinito de decimales para ser representados exactamente. 
</p>

<p>
La secuencia de decimales se trunca debido a que el almacenamiento es finito.
</p>

<p>
La mayoría de las operaciones aritméticas implican números reales inexactos, 
lo que resulta en cálculos inexactos propagando el error.
</p>
</div>
</div>


<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">6</span> Ejercicios</h2>
<div class="outline-text-2" id="text-6">
<p>
Cuando se cocina de huevo, las proteínas se desnaturalizan primero y luego se coagulan. 
Cuando la temperatura excede de un punto crítico, las reacciones comienzan y ocurren más rápido a medida que aumenta la temperatura. 
En la clara de huevo, las proteínas comienzan a coagular en temperaturas por encima de 63 C, mientras que en la yema las proteínas
empezar a coagularse en temperaturas superiores a 70 C. 
</p>

<p>
Para un huevo suave, el blanco tuvo que haber sido calentada lo suficiente para coagular a una temperatura por encima de 63 C, 
pero la yema no debe calentarse por encima de 70 C.
Para un huevo duro, el centro de la yema se debe permitir llegar 70 C.
</p>

<p>
La siguiente fórmula expresa el tiempo t (en segundos) que tarda el centro de la yema para llegar a la temperatura Ty (en grados centígrados):
</p>

<p>
\[ t = \frac{M^\frac{2}{3}cp^\frac{1}{3}}{K \pi^2 ( 4 \pi /3 )^\frac{2}{3}} ln ( 0.76 \frac{T_0 - T_w}{T_y - T_w} ) \]
</p>

<p>
Donde M, p, c, K son propiedades del huevo:
</p>
<ul class="org-ul">
<li>M : masa</li>
<li>p : densidad</li>
<li>c : capacidad calorifica</li>
<li>K : conductividad termica</li>
</ul>


<ul class="org-ul">
<li>M = 47 gr (para un huevo chico)</li>
<li>M = 67 gr (para un huevo grande)</li>
<li>p = 1.038 gr/cm3</li>
<li>c = 3.7 J/(gr * K)</li>
<li>K =  5.4 * 10<sup>3</sup>  W/(K*cm)</li>
<li>Tw es la temperatura en grados centigrados del agua hirviendo.</li>
<li>To es la temperatura original en grados centigrados del huevo antes de entrar al agua.</li>
</ul>

<p>
Implementar la fórmula y calcular t para un huevo tomando:
</p>
<ul class="org-ul">
<li>Tw = 100</li>
<li>Ty = 70</li>
<li>To = 4 (huevo en el refrigerador)</li>
<li>To = 20 (huevo temperatura ambiente)</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Fernanda Sanchez</p>
<p class="date">Created: 2016-08-22 Mon 19:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
